uhnp/src/InformationRegisters/ОтветственныеОрганизаций/ОтветственныеОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеОрганизаций</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ОтветственныеОрганизаций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрЗначениеОбъекта = Параметры.ЗначениеОбъектаОтветственного;
	ТипПараметрЗначение = ТипЗнч(ПараметрЗначениеОбъекта);
	МассивТипЗначение = Новый Массив;
	МассивТипЗначение.Добавить(ТипПараметрЗначение);
	Если ЗначениеЗаполнено(ПараметрЗначениеОбъекта) Тогда
		Запись.Организация = ПараметрЗначениеОбъекта;
		Элементы.Организация.Заголовок = Строка(ТипПараметрЗначение);
		Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов(МассивТипЗначение);
	Иначе
		Если ТипПараметрЗначение <> Тип("Неопределено") Тогда
			Запись.Организация = ПараметрЗначениеОбъекта;			
			Элементы.Организация.Заголовок = Строка(ТипПараметрЗначение);
			Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов(МассивТипЗначение);
		Иначе
			// Оставляем значение по умолчанию.
		КонецЕсли;
			
	КонецЕсли;
	
	Если Параметры.Свойство("Роль") Тогда
		Запись.Роль = Параметры.Роль;
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Запись.Пользователь = Параметры.Пользователь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкиВводаКлиент()
		
	Элементы.Организация.ПодсказкаВвода = ?(Запись.Организация = неопределено, НСтр("ru = '<Не определено>'"), СтрШаблон(НСтр("ru = '<%1: все элементы>'"), Строка(Запись.Организация.Метаданные())));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьПодсказкиВводаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПодсказкиВводаКлиент();
	
КонецПроцедуры
